Revit 2024 API
BuiltInFailures.StairRampFailures.LandingDepthIsLessThanRunWidthWarning Property
 Landing depth is less than run width.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LandingDepthIsLessThanRunWidthWarning { get; }
Visual Basic
Public Shared ReadOnly Property LandingDepthIsLessThanRunWidthWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LandingDepthIsLessThanRunWidthWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace